[
    {
        "video_id": "ukzFI9rgwfU",
        "title": "Machine Learning | What Is Machine Learning? | Introduction To Machine Learning | 2024 | Simplilearn",
        "url": "https://www.youtube.com/watch?v=ukzFI9rgwfU",
        "duration": 472,
        "transcript": "we know humans learn from their past experiences and machines follow instructions given by humans but what if humans can train the machines to learn from the past data and do what humans can do and much faster well that's called machine learning but it's a lot more than just learning it's also about understanding and reasoning so today we will learn about the basics of machine learning so that's paul he loves listening to new songs he either likes them or dislikes them paul decides this on the basis of the song's tempo genre intensity and the gender of voice for simplicity let's just use tempo and intensity for now so here tempo is on the x axis ranging from relaxed to fast whereas intensity is on the y axis ranging from light to soaring we see that paul likes the song with fast tempo and soaring intensity while he dislikes the song with relaxed tempo and light intensity so now we know paul's choices let's say paul listens to a new song let's name it as song a song a has fast tempo and a soaring intensity so it lies somewhere here looking at the data can you guess whether paul will like the song or not correct so paul likes this song by looking at paul's past choices we were able to classify the unknown song very easily right let's say now paul listens to a new song let's label it as song b so song b lies somewhere here with medium tempo and medium intensity neither relaxed nor fast neither light nor soaring now can you guess whether paul likes it or not not able to guess whether paul will like it or dislike it are the choices unclear correct we could easily classify song a but when the choice became complicated as in the case of song b yes and that's where machine learning comes in let's see how in the same example for song b if we draw a circle around the song b we see that there are four votes for like whereas one would for dislike if we go for the majority votes we can say that paul will definitely like the song that's all this was a basic machine learning algorithm also it's called k nearest neighbors so this is just a small example in one of the many machine learning algorithms quite easy right believe me it is but what happens when the choices become complicated as in the case of song b that's when machine learning comes in it learns the data builds the prediction model and when the new data point comes in it can easily predict for it more the data better the model higher will be the accuracy there are many ways in which the machine learns it could be either supervised learning unsupervised learning or reinforcement learning let's first quickly understand supervised learning suppose your friend gives you one million coins of three different currencies say one rupee one euro and one dirham each coin has different weights for example a coin of one rupee weighs three grams one euro weighs seven grams and one dirham weighs four grams your model will predict the currency of the coin here your weight becomes the feature of coins while currency becomes the label when you feed this data to the machine learning model it learns which feature is associated with which label for example it will learn that if a coin is of 3 grams it will be a 1 rupee coin let's give a new coin to the machine on the basis of the weight of the new coin your model will predict the currency hence supervised learning uses labeled data to train the model here the machine knew the features of the object and also the labels associated with those features on this note let's move to unsupervised learning and see the difference suppose you have cricket data set of various players with their respective scores and wickets taken when you feed this data set to the machine the machine identifies the pattern of player performance so it plots this data with the respective wickets on the x-axis while runs on the y-axis while looking at the data you'll clearly see that there are two clusters the one cluster are the players who scored higher runs and took less wickets while the other cluster is of the players who scored less runs but took many wickets so here we interpret these two clusters as batsmen and bowlers the important point to note here is that there were no labels of batsmen and bowlers hence the learning with unlabeled data is unsupervised learning so we saw supervised learning where the data was labeled and the unsupervised learning where the data was unlabeled and then there is reinforcement learning which is a reward based learning or we can say that it works on the principle of feedback here let's say you provide the system with an image of a dog and ask it to identify it the system identifies it as a cat so you give a negative feedback to the machine saying that it's a dog's image the machine will learn from the feedback and finally if it comes across any other image of a dog it will be able to classify it correctly that is reinforcement learning to generalize machine learning model let's see a flowchart input is given to a machine learning model which then gives the output according to the algorithm applied if it's right we take the output as a final result else we provide feedback to the training model and ask it to predict until it learns i hope you've understood supervised and unsupervised learning so let's have a quick quiz you have to determine whether the given scenarios uses supervised or unsupervised learning simple right scenario one facebook recognizes your friend in a picture from an album of tagged photographs scenario 2 netflix recommends new movies based on someone's past movie choices scenario 3 analyzing bank data for suspicious transactions and flagging the fraud transactions think wisely and comment below your answers moving on don't you sometimes wonder how is machine learning possible in today's era well that's because today we have humongous data available everybody is online either making a transaction or just surfing the internet and that's generating a huge amount of data every minute and that data my friend is the key to analysis also the memory handling capabilities of computers have largely increased which helps them to process such huge amount of data at hand without any delay and yes computers now have great computational powers so there are a lot of applications of machine learning out there to name a few machine learning is used in healthcare where diagnostics are predicted for doctor's review the sentiment analysis that the tech giants are doing on social media is another interesting application of machine learning fraud detection in the finance sector and also to predict customer churn in the e-commerce sector while booking a gap you must have encountered surge pricing often where it says the fair of your trip has been updated continue booking yes please i'm getting late for office well that's an interesting machine learning model which is used by global taxi giant uber and others where they have differential pricing in real time based on demand the number of cars available bad weather rush r etc so they use the surge pricing model to ensure that those who need a cab can get one also it uses predictive modeling to predict where the demand will be high with the goal that drivers can take care of the demand and search pricing can be minimized great hey siri can you remind me to book a cab at 6 pm today ok i'll remind you thanks no problem comment below some interesting everyday examples around you where machines are learning and doing amazing jobs so that's all for machine learning basics today from my site keep watching this space for more interesting videos until then happy learning"
    },
    {
        "video_id": "KNAWp2S3w94",
        "title": "Intro to Machine Learning (ML Zero to Hero - Part 1)",
        "url": "https://www.youtube.com/watch?v=KNAWp2S3w94",
        "duration": 438,
        "transcript": "♪ (music) ♪ You've probably heard a lot\nabout AI machine learning over the last few months. And maybe you've been inspired\nby videos showing what's possible with AI machine learning. But what is it really? Once you go beyond the hype\nand get down to writing code, what does AI really look like? Well, that's what we're going\nto go through in this video series, where we'll teach you what it's like\nto write code for machine learning, and how it provides different,\nnew, and exciting scenarios that will help you write applications that behave more like a human being,\ngiving you artificial intelligence. I'm Laurence,\nand I'm going to be your guide. You don't need\nto know a lot to get started, and we'll be using the Python language. Don't worry if you've never used it,\nit's super simple to understand, and you'll be up and running in no time. So let's start with a very simple example. Consider you're creating a game\nof Rock, Paper, Scissors. When you play this\nwith a human, it's very basic; every child can learn it\nin just a few minutes. Now, let's take a look\nat the most basic part of a game that the human brain is really good at, and that's recognizing\nwhat it's actually looking at. So consider these images. Most people can look at them\nand instantly recognize which ones are rock, which ones are paper, and which ones are scissors. But how would you program\na computer to recognize them? Think about all of the diversity\nof hand types, skin color, and even people who do scissors\nlike me, with their thumb sticking out, and people who do scissors\nwith their thumb in. If you've ever written any kind of code,\nyou'll instantly realize that this is a really,\nreally difficult task. It might take you thousands\nor tens of thousands of lines of code, and that's just to play\nrock, paper, or scissors. So what if there was\na different way to teach a computer to recognize what it sees? What if you could have\na computer learn in the same way that a human does? That's the core of machine learning\nand the path to artificial intelligence. So traditional programming\nlooks like this. You have data, for example,\na feed from the webcam, and you have rules that act on this data. These rules are expressed\nin a programming language and are the bulk\nof any code that you write. Ultimately, these rules will act\non the data and give you an answer. Maybe it sees a rock,\nmaybe it sees a paper, and maybe it sees scissors. But what if you turn this diagram around, and instead of you as the programmer\nfiguring out the rules, you instead give\nit answers with the data and have the computer\nfigure out what the rules are. That's machine learning. So now, I can have\nlots of pictures of rocks and tell a computer\nthat this is what a rock looks like, and this is what paper looks like, and this is what scissors looks like. And I can have a computer\nfigure out the patterns that match them to each other. Then, my computer will have learned\nto recognize a rock, paper, and scissors. That's the core of building something\nthat uses machine learning. You get a set of data\nthat has patterns inherent in it, and you have a computer learn\nwhat those patterns are. Before we write a neural network that learns something as complex\nas rock, paper, and scissors, let's use a much simpler example. Take a look at these numbers-- there's a relationship\nbetween the X and Y values. Can you see it? It's actually Y = 2X - 1. So if you saw it, how did you get that? Maybe you noticed\nthat the Y value increases by 2, while the X value only increases by 1. So it was Y = 2X \nplus a minus something. And then, you may have seen\nthat when X was zero, Y was minus one, so you figured Y = 2X - 1\nwould be a good guess, and then you took a look\nat the other numbers and saw that it worked. That's exactly the principle\nthat all machine learning works on. So let's take a look. This is the entire code that you can use\nto create a machine-learned model that figures out what matches\nthese numbers to each other. Don't worry if some of it\ndoesn't look very familiar right now, you'll be able to pick that up in no time. This first line defines the model itself. A model is a trained neural network, and here we have\nthe simplest possible neural network, which, in this case, is a single layer\nindicated by the keras.layers.Dense code. And that layer has a single neuron in it,\nindicated by units = 1. We also feed a single value\ninto the neural network, which is the X value, and we'll have the neural network\npredict what the Y would be for that X. So that's why we just say\nthat input_shape is one value. When you compile the model, \nthere are two functions: the loss and the optimizer. These are the key to machine learning. How machine learning works\nis that the model will make a guess about the relationship\nbetween the numbers. For example, it might guess\nthat Y = 5X + 5. And when training, it will then calculate how good or how bad that guess is,\nusing the loss function. And then, it will use\nthe optimizer function to generate another guess. The logic is that the combination\nof these two functions will slowly get us closer and closer\nto the correct formula. And, in this case, it will go through\nthat loop 500 times, making a guess, calculating\nhow accurate that guess is, and then using the optimizer\nto enhance that guess, and so on. The data itself is set up\nas an array of Xs and Ys, and our process\nof matching them to each other is in the fit method of the model. We literally say, \"fit the Xs\nto the Ys and try this 500 times.\" When it's done,\nwe'll have a trained model. So now you can try to predict\na Y value for a given X. What do you think would happen\nif you tried this line of code predict the Y when X equals 10? You might think\nthat the answer is 19, right? But it isn't. It's actually something like 18.9998. It's close to 19,\nbut it's not quite there. Why do you think that would be? Well, the computer was trained\nto match only six pairs of numbers. It looks like a straight-line relationship\nbetween them, for those six, but it may not be a straight line\nfor values outside of those six. There's a very high probability\nthat it's a straight line, but we can't be certain. And this probability is built\ninto the prediction, so it's telling us a value very close \nto 19, instead of exactly 19. Try the code out using the link\nin the description below this video to see it for yourself. This is something you'll see\na lot more of in machine learning. And in the next video in this series,\nwe'll take what you've learned and apply that\nto a more interesting problem-- computer vision-- and seeing how you can\nteach a computer to see things, using exactly the same methodology\nas you used here. We'll see you in that video, and don't forget to hit\nthat subscribe button. Thank you! ♪ (music) ♪"
    },
    {
        "video_id": "6mSx_KJxcHI",
        "title": "Introduction to Machine Learning for Beginners [Part 1] | Machine Learning for Beginners",
        "url": "https://www.youtube.com/watch?v=6mSx_KJxcHI",
        "duration": 202,
        "transcript": "hello and welcome to this course on classical machine learning for beginners whether you're completely new to the topic or an experienced ml practitioner looking to brush up on an area we're happy to have you join us this course is based on the free open source 26 lesson ml for beginners curriculum from Microsoft which can be found at AKA dot Ms slash ml-beginners machine learning is one of the most popular Technologies these days I'm sure you've heard this term if you have any sort of familiarity with technology no matter what domain you work in however the mechanics of machine learning are a mystery to most people and the subject can sometimes feel overwhelming in this course you'll start right from the beginning and you'll learn about it step by step to practical Hands-On coding examples let's start by talking about the difference between artificial intelligence and machine learning AI is a science of getting machines to accomplish tasks that typically require human level intelligence many different techniques have been proposed for AI but the most successful and popular approach these days is machine learning unlike other AI techniques ml uses specialized algorithms to make decisions by learning from data so machine learning is really a subset of artificial intelligence you've also probably heard of deep learning which is a subset of machine learning that relies on neural networks to learn from data in this course we're going to cover what we call classical machine learning you'll learn some Core Concepts of ml a bit of History statistical techniques like regression classification clustering and more the concepts you'll learn here will serve you well as you progress to more Advanced Techniques keep in mind that this course won't cover data science deep learning neural networks and AI techniques other than ml Microsoft offers two additional courses for you to learn more about these areas data science for beginners available at AKA dot Ms slash data science beginners and AI for beginners available at aka.ms Ai and beginners machine learning is a Hot Topic because it's solving complex real-world problems in so many areas Finance earth science space exploration cognitive science and many more Fields have adopted machine learning to solve problems specific to their domains for example you can use machine learning to predict the likelihood of disease from a patient's medical history to anticipate weather events to understand the sentiment of a text and to detect fake news and stop the spread of propaganda applications of machine learning are almost everywhere and are as ubiquitous as the data that is Flowing from our devices and systems because of how useful it is understanding the basics of machine learning is going to help you no matter what domain you're coming from in the next video in the series I'll give an overview of the history of ml I'll see you there"
    },
    {
        "video_id": "L1WXekOFBpc",
        "title": "Introduction to Machine Learning | ML Basics for Beginners",
        "url": "https://www.youtube.com/watch?v=L1WXekOFBpc",
        "duration": 4086,
        "transcript": "so as I have already said the today's agenda so I have saved time that's why I have taken you know prior to the class I don't want to waste my time while writing inside the class because you know lot of uh things that we need to discuss as part of today's agenda okay so anyhow this is the introduction class I have already given the uh heading as introduction to ml ml is nothing but stands for machine learning okay we'll uh see what is that machine learning and all then uh going forward also we'll see what is linear regression and anyhow I'm not going to complete the entire linear regression in today's class it is a part one session I mean the first some part will cover and I'll continue uh rest of the part in the next session and we will complete there itself fine so as part of today's class we'll discuss about the entire AI Universe uh okay what is AI and all we'll discuss nothing to be worry then introduction to mchine learning then horological structure of machine learning algorithm then we'll discuss about regression line what is regression line and all several types of regression model analysis types of linear regression model uh visual plot of regression model then best fit line how to draw best fit line we'll talk about that then we'll talk about some important matrices evaluation matrices that is residual sum of squares is RSS then we'll talk about what is gradient what is cost function okay then we'll talk about uh strength of simple linear regression then we'll see some formula about you know residual square of resal square error sum of square then RSS TSS R square everything we'll see okay so one by one we'll see so let me let me hold my you know markers and let's start a journey okay fine so first one is AI Universe okay so let me just write down so yeah first one okay let me choose my favorite color Al together yeah no how is got change I want black color is it no this is gray where is black who CH by number okay fine not an issue AI Universe guys uh you might have heard about lot of terminology nowadays which is revolved around the data okay whenever you are talk we are talking about mine learning before entering to mine learning learning uh we have to understand what is this ai ai stands for let me go from the basic even though you know please bear with me don't feel boring sir we know this thing that's fine because most of the people they don't know also first time they're hearing what is ai ai stands for artificial intelligence and any I have written ml stands for M learning which we are going to learn the entire uh syllabus okay and you might have heard about there another terminology called DL DL me not not driving license okay driving license people are thinking driving license no no no it's not driving license d stand for deep learning deep learning okay let's try to understand where we exist exactly then we'll enter into the our subtopic or the exact topic that is Meine learning so if I draw if I will draw a set diagram or kind of pin diagram then I can easily explain where exactly we stand if I tell the AI universe is nothing but the entire universe of the AI world is like this which is nothing but AI the subset of AI is nothing but the M learning mL no doubt I'll show you a beautiful diagram for that just I'm explaining by taking my white Bo okay then I can say the subset of Miss learning is nothing but DL that is deep learning that means if I tell DL which is present inside ml I mean ml encapsulate DL and ml again recites inside AI that's why I've given the heading as AI Universe means enter World because AI contains both A and D and no doubt in between there lot of things are there you know need to try to understand for time being going forward obviously as part of the knowledge I can tell you for time being but you need to understand again as part of the DL we have something called ji okay generative A J AI which stands for generative generative AI okay AI stands for again artificial intelligence and so if I draw then again it is subset of D so I can write J J fine any it's not required for us out of the syllabus for timeing okay for us we are not going to learn here J and D okay so where we res if I ask could you please tell me where we res we reses here exactly exactly here so we'll try to learn what are the related things related to ml not to DL not to jna not to the enter AI also so because when I'm telling ml few algorithm will be there which is related to ml lot many other will be there which are related to DL maybe yeah certain things are there which are related to artificial intelligence some fancy color I'm choosing today I don't know which color it is okay so then let me choose some different color yeah any there is no space okay jna also something like this so don't think that we are trying to learn all the things enter within this two month or three month or maybe after your you know post semester exam nothing like that we are just giving focusing on learning the ml part like the red color area you can see what are the things related to M learning only there itself we learn a lot forget about other things because that is a key point of each and everything you nowadays you might have had okay mine learning engineer lot of profiles are related to that so we have something called we have something called M let me change the color yeah M there's a profile called M that is called machine learning in short I'm writing machine learning engineer then there is something called you might have heard about DS it stands for it's very famous One data scientist okay then data related other profiles I can say that's something called [Music] da stands for data analyst okay then we have something called Data engineer but that's again a different story Al together okay then in uh related to M I can say machine learning we have something called mlops ml OBS so what is mlops uh people uh generally the traditional you know before data science come the market you know right people who are working in the software industry they are claiming them as a software developer or software engineer right yes see okay now I talking about before uh data science come into the market generally people who are working in a software industry they claiming this thems as a software developer software engineer software so let me write software engineer right or you can say software developer so whenever you join in the industry you get to know I'm just giving overall idea whenever you join an industry let's say as a developer your work is to develop an application software application once you develop people who are working in testing team their work is to test the application that you develop or developed by the developer once that is complete it will go to the production phase so who will deploy the production for that there is a dedicated separate team those team people are called devops DB OBS OBS Dev devops is nothing but a combination of two different word that is called development d v l o p m n development plus op Ops OP stand for operation o p e r a t i o n so this is for normal developmental software application so let's say this is my software application okay my software [Music] software application similarly nowadays a new com to the market or new profile Comm Market related to data science and all or mine learning I can say so people who are working in mine learning they call as they call thems as M like as I have already written above right in the above mle M that is nothing but M learning machine learning engineer e n g i n e e r machine learning engineer okay who is thinking F okay machine learning engineer now once as a machine learning engineer you develop the machine learning application not that is not the normal software application that is a machine learning application then again it will move to the test in page or the people who are working as a tester they will test it once it will complete then it will move to the production page the team which is responsible to move your machine learning application to production phase that is called those team people they claim themselves as mlops engineer what is the full form of mlops is again combination of two different work machine learning ml ml plus Ops ml stands for mine learning M learning and off stand for operation operations operations similarly if I draw the diagram if I draw the diagram so it will be not normal not your normal software application it is a m learning application machine learning application or software application clear guys so these are the profile different different job role if you know M learning you can become a m you can become a data scientist obviously for data analys not required because data analys little bit lower uh designation I mean I can say lower grade designation that data scientist and you can become ml but to become a mlop in addition to machine learning operation or machine learning language you need some operational operation operational knowledge to deploy it for example like you know Dockers cuet uh aw Hemer for if I go to the cloudbase right aw Hemer GTH of Docker then GTH of action lot many things airflow lot many other tools you have to know to become a mlops but to become a machine learning engineer if you know machine learning and some sort of let's say SQL uh some programming language like Python and then I can say let's say some visualization tool like table or power that is more than enough to become a m learning engineer clear guys any doubt so far any doubt so far so uh yeah we have already completed AI universe and we have also completed introduction to machine learning and LW now let's come back to hierarchical structure of M Learn okay so this is a point one I can write so this is the point two also I have completed anyhow here introduction to M learning I'll go through officially not an issue so this is my point to introduction to [Music] Miss Lear I'll go a little bit in depth while sharing my PP okay don't worry for second point and I'll show I'll show you lot of beautiful diagram related to point number one okay let me just explain first try to understand then I'll go through my PP so that you it will feel easy to see it and to observe it okay now Point number three iCal structure of machine learning algorithm okay in short I'm just writing okay or shall I write all the things okay okay let me write hcal structure of in short I'm writing machine learning algorithm M algorithm okay guys coming to mine learning it is of different type to solve different different problem statement different different problem State I got a B sound let me see just one me see yeah okay now we use mine learning to solve different different problem statement what are those let's try to understand one by one okay now coming to different type of M learning we have something called supervised s supervised mine learning algorithm then we have something called all supervised [Music] [Music] unsupervised machine learning algorithm what is supervised machine learning what is unsupervised machine learning what is the difference between that everything will discuss in depth nothing to be worried just just focus on my watch okay just follow me okay now guys Frankly Speaking In addition to these two different classes also there's a one more classes present I mean if you follow the official website or any books you'll definitely find so for that sake for knowledge sake I'm just giving but that is not that much important that's not required for you right now that's why not to confuse you I'm not writing here now I'm just telling you only two things but for a knowledge sake if you ask me sir is it like machine learning algorithm is of two types are you sure no then for that I'm just writing for knowledge sck guys okay so that nobody should you know blame me in the future or they can come back sir you told two types but in the books it's written three types or maybe in the internet I have seen somewhere in the website is three typ for that knowledge check only I'm writing there is something called reinforcement reinforcement learning learning okay what is reinforcement learning that is not of our business that is none of our business and we are not here right now to learn that things that's why don't focus on that just I'm writing for your knowledge check if somebody will ask tell me what type of different machine learning algorith algorithms are there then you can tell we have something called supervised machine learning there's something called unsupervised machine learning then there is something called reinforcement learning but as we are not going to learn as part part of our curriculum I not writing that one I'm not highlighting that one so now you just focus on these two types going forward Mak sense guys now coming to supervis machine learning guys again it is of two types again it is of two types that is something called regression another one is called classification okay regression and classification similarly coming to unsupervised machine learning it is of again two types again two types one is called clustering and there is something called uh dimensionality reduction technique Dimension m n d i o n dimensionality reduction reduction technique t c n i q generally we call this part as kind of you know advance advance ad advance machine learning algorithms and all okay algorithms and all okay algorithms and all okay guys Frankly Speaking as part of your curriculum in the sense like as part of your semester exam we are going to discuss are complete in depth all these three as I have notified I hope if I'm not wrong before your semester midterm exam we are going to complete the regression algorithm and classification algorithm then after your midterm exam then we are going to complete in extensively clustering algorithm as okay I'm not sure whether we are going to complete or not I have to go through again the syllabus and okay but I'm able to recall I hope this three I'm sure okay we are going to before midterm this two after midterm maybe this one or maybe they have included based your curriculum that I need to cross check one more time fine guys now so these are just the name what is regression what is classification what is clustering everything will discuss nothing to be wor okay nothing to now generally whenever I'm telling guys regression algorithm what do you mean by that that means there are certain algorithm given by the researcher or scientist by using which we can solve a problem statement which is a regression problem statement so if I write down example for example regression so sir can I can you give example of regression algorithm yes so let me write down something like linear regression linear regression okay linear regression how I'm writing okay then we have something called multiple multiple regression multiple simp regression any this is simple regression because again linear regression divide into two types simple linear regression and multiple linear regression linear regression and all these are the example of regression algorithm similarly coming to classification we have something called uh logistic logistic regression okay okay now coming to clustering uh you know that we'll cover after your exam so it is something like that I think C in clustering if I'm not wrong okay uh kin's clustering uh that is something called hcal clustering okay hierarchical clustering and all so these are the algorithm or the example of that category so if I tell simple linear regression is nothing but algorithm by using which you can solve a regession problem statement if I tell logistic regression is nothing but algorithm by using which you can complete a classification problem statement if I tell what is hcal clustering is nothing but algorithm by using which you can solve a problem statement which is related to clustering problem statement guys clear any doubt so far any doubt so far please please let me know okay so can I mark it I don't think so yeah I can mark it so this is completed this is completed okay now this is a time to go back to my slide okay okay let me see is there any things I have left and in addition that as I have given commitment I'll show you some beautiful diagram related to the point one and we'll discuss something extensively different application of machine learning algorithm what is the life cycle everything later point two and all then point three any I have not draw the needed clean diagram but I'll show you okay give me one minute let me reare let me stop fine is it okay fine now as I told you so this is the entire universe artificial intelligence versus mine learning versus deep learning so where we starts exactly you can figure it out by seeing this beautiful diagram the entire universe is artificial intelligence then subset is M Lear which again contains the Deep learning and all now sir could you please show me a kind of diagram where we'll get to know the different text tag that is involved and again we know like gen is the part of deep learning Al together right so let me go to the next slide yeah this is the entire a universe with which I have we have started our classes today you can see artificial intelligence which is I mean again machine learning is a subset and I can say artificial intelligence is the super set then machine learning is a softs set then again neural Network then we have something called Deep learning then inside deep learning we have something called generative AI don't Focus any other thing just focus on machine learning area let me maximize it guys what are things written here are you able to see there is something called regression if you I'm not wrong let me maximize it's possible yeah is possible regression that is something called classification that is something called clustering yes or no in addition of that there's something called reinforcement l learning right and this is the part of like supervised learning unsupervised learning that I have already categor I'll show you another diagram okay don't worry about all the things these are the advanced Meine learning technique like as I told you let's say classification right I have written in my whiteboard logistic regession now one person can ask me is it like only one algorithm that is logistic regression is present to solve classification problems no in addition to that multiple lot of other algorithms are present what are those if I tell that those are nothing but that is something called decision tree there is something called random Forest there is something called egg boost ad boost lot of other things are there supp Vector machine as well so these are the things written here and here you can see diality reduction technique which I have also written my white so here and there they just written in a random manner but I have written in a sequential manner how we proceed or how we study one by one step by step okay but all the things are present here nothing to be wor other part because that is not part of our curriculum for timing just focus on this machine learning Area machine learning area clear clear guys any doubt so any doubt so now let's go to the next slide what is machine learning definition so according to Tom Mitchell which is nothing but a computer scientist in us okay obviously he has lot of contribution in the machine learning area that's why he is giv a beautiful definition according to him machine learning is the study of computer algorithms that allow computer programs to automatically improve through experience so what is that all the things we learn one by one nothing to so what is telling mchine learning is nothing but the study of computer algorithm that allow computer program to automatically improve through experience how it improves and all that will see one by one let's proceed now human versus computer guys try to understand how things are working behind the scene generally in case of human being first we will focus on human being how human being things process and execute or convert into action then similar stop will just replicate in the computer itself I think about a human being take the decision based upon the past experience correct or not computer can create model by using the data like how a human being a person take the decision based upon the experience similarly a computer create the model based on the data set giv data set or input data set so you can see a human being just thinking okay I make decision based upon the experience my past experience right now now computering I make model based on the data so whatever data will give me I'll train it I'll build the models I'll learn from it okay everything we see one by one now see humans follow this formula all human are used to follow some pattern or formulas to take the next best action first remember then formulate then predict okay generally we remember past situation that we are similar we formulate a general rule we formulate a general rule then we use this rule to predict what will happens if we take a certain decision for example okay I'm give you example that you will be clear 100% okay let me maximize it example for suppose to answer for a question like will it rain today or not just simply question I'm asking guys please tell me will it rain today or not then we will follow one process to answer this question right what is that process we maybe right or wrong that different case because for example in our class totally 52 to 55 students are there if I ask the same question will it run today or not it's not like that all the 52 students will tell or 55 students will tell no sir it will not run R some people will tell yes it may R some people say no it will not r i mean answer may be correct right or wrong that is different story but at least we are trying to make an accurate prediction what is that prediction now based upon my past experience what experience I have G it rain most of the day last week for example last week all almost all the days from last Monday Tuesday Wednesday Thursday Friday Saturday Sunday and all every day most you are seeing it's raining so it rain most of the day last week now you're thinking I think it rains most of the time not only just last week most of the time it's not like that just 15 minutes R then another 23 hours uh let's say 45 minutes does not R nothing like that almost all the time continuous raining due to know cycl condition and all whether different bad weather condition and all then you will predict it will probably rain today also why because you are seeing from last seven days the weather condition is too bad it's raining almost 24 by7 almost 24 by7 then there is a high chances there it may rain today that's why while going outside you can see there a prediction okay it may rain today so let me carry my umbrella with me that's why it's carrying the umbrella with me noway maybe umbrella or R Whatever May but purpose it's carrying umbrella with him understand this is the remember he remember it then formulate then based upon the formula he predict he or she predict it may rain today also clear guys any doubt so far any doubt so far now now let's move to the next how to Meine think now it's go up to you know human being how human being thinks first remember then formulate okay after formulate predict similarly how does me m the goal is to make the computer thing the way we think namely how we use the remember formulate and predict framework three different component guys nothing else remember formulate predict remember means you have to just remember something formulate means you are just creating certain formula based upon that past experience then predict you have to predict based on the future that's here at the point what the computer does in each of the step what are the steps first remember how we are remembering for that computer looks at the given huge data set now formulate how human being is doing the formulate now for computer it is going through Rule and formulas and check which one which one which fits the data so best fit model we discuss everything which model we have to fit here that depends upon the problem statement like as I told you if you are going to solve a regression problem statement No Doubt you have to use either simple linear regression or multiple linear regression or some other regression algorithm as well for example you are going to solve the classification problem statement then you are going to use either logistic regression or decision Tre or random forest or exib and so on okay that's why it's telling which pit means which algorithm pit for that data set only now predict use the rule to make prediction about future data so how a human being is doing prediction similar whatever the rule computer machine has created that rule he has to fit on top of the unknown data set to make prediction about the future real time example Gmail application banking loan application or credit card eligibility for example you have appli for credit card whether you are a eligible person whether they will sanction a credit card for you or not they will dispatch a credit card for you or not for that in the behind the they running a machine learning algorithm whether you are genuine person or frud person whether bank will give loan to you or not so eligibility criteria they seeing or not guys you might have apply for the loan let's say study loan and all anyhow a bank they don't give loan directly to us to you obviously it may be a joint account between your parents and you then uh they are the I can say guar obviously and the bank is giving loan study loan to you okay because you don't have back up you canot so okay this is my income so this is my backup these are my asset So based upon that give me some loan no nobody will give loan like like that fine now introduction to machine learning let's look at some us cases where machine learning model are used we'll also look at the relationship between variable you know so modeling so this is a kind of deep learning algorithm guys and Just sh in the picture so it's a object detection I'm nothing to wor for knowledge I'm just telling when you go for you know higher study obviously in the next semester or maybe the in the future when learn the Deep learning so at the time there is a concept called object detection so by using object detection wherever the cards are there you can see there rectangular box I'm just you know donating or I'm just creating to detect it saying that okay this is my object this is my object object in the sense here I'm trying to predict only the car object not other things in a it can be anything object human being or maybe a dog that may be object right but here my intention is to predict only car that's why for me here car is the object that's why you can see that a rectangular box just around surrounding the car only this kind of object detection similarly go to the next one okay guys any doubt so far any doubt so far please let me know you can see another example let's say predicting requirement of Emergency Services you can see let's say there are four beds are there in the hospital that maybe due to emergency more than four people may came like you know maybe five people or six people make came at the time then how to manage that it's not like that you will tell okay he's the richest person give bed to them he's the poorest person okay let them sleep on the floor no nothing like that right so how to manage them and it's not like that you have to always keep 10 B sorry 100 beds always no it's also in West because 100% are not coming as emergency basis uh at a time right so how to predict that that also for prediction uh predicting also we are using M learning algorithm and not obviously whenever we get into doing any project we get to okay now okay now I just talking about different kind of machine learning which I have already written in my whiteboard hcal structure of machine learning you can see there is something called supervised machine learning there is something called unsupervised machine learning there is something called reinforcement learning but so forget about that now focus on this so coming to supervis mey learning we have something called regression and classification coming to unsupervised machine learning we have something called cluster okay as I have told you for knowledge s there's something called you know dimensionality reduction technique and okay just few times before okay I have seen somebody as a message as a beautiful concept sir no no sir coming to supervise sir in addition to regression and classification we have something called time series and all yes guys that is also true but not to confuse you I'm not keeping all the things so he's telling so three types nothing like three types in addition that we have something called recommendation system okay we have something called recommendation system as well so it's not only time series not only classification not only regression we have something called recommendation system time series forecasting so recommendation system forecasting time series obviously regression classification and all lot many things are there so nothing to be worri don't be confused that is again is just a kind of you know Advanced thing on the extended things of this regression problem statement and all but the basic core concept is regression problem statement if you know how to solve a regression problem statement then whether it's a Time based or non-time based means if it a Time based that time series based regression problem statement if it's not time based normal regression problem statement that's all but if you understand regression problem statement doesn't matter whether a Time series based or non time series based happily you can solve that problem St okay clear guys any doubt so far any doubt so far now we can see so what kind of problem statement we are going to solve as part of the miss learning so for that I'm giving an example let's say the three main category of machine learning model are based on the type of the task they perform and the nature of the output the regession model are used for predicting a continuous variable such as the price of a house based upon the factor such as size and the proximity to school so how far from it is school the distance and based upon the you know Square fet size or area so price will be decided so whenever the price will be decided this a kind of regression problem step why because you are going to trade a continuous variable or continuous output okay you can see similarly here also another example last year data so X math score so is kind of percentage like the attendance and all similarly if I give this year current year X math score can you predict the percentage I mean the percentage of what like attendance and all yes that also we can do this is another example of regression problem statement and all okay any we'll solve a definitely good regression problem statement in the class itself okay nothing to be wor I will explain each and everything now we can see it's a kind of classification problem statement how for example a mail is coming guys you might have seen sometimes a male is coming to a mail is coming Gmail is coming mail is coming to a Gmail sometimes it is there in the inbox you might have seen sometimes going to spam folder that is a folder called spam folder guys you know why it's is going to spam folder because behind the scene Google they have written a m algorithm a kind of classification problem statement if they found out any harmful things in that male which is not which is little suspicious then the algorithm itself predict hey that is some a kind of junk mail or that it's not something something is a you know fish in this mail could you please move that mail to spam folder not to inbox folder are you might have seen while opening is also giving a warning message it may harm your system or achievement will you like to move to inbox if you click okay me you are giving permission at the time it's going to inbox otherwise it will be there in the spam better not to open because nowadays lot of false things are happening you can simply delete make it move to th and maybe permanent deletion and all so that is nothing but a classification model is working behind the scene to distinguish between whether it's a good mail or spam mail H mail spam mail or H mail at all you can see okay email you are opening in the mobile phone account clear guys any doubt so far any doubt so far now so let me explain what is the SP and so Gmail application basically Gmail is the very wellknown example of we are all known about spam folder too before I was telling the same things spam folder is nothing but it's just a common term used for junk or unwanted email such as know Chain Letter promotion and so on how is not equ it is the common term used for non-spam mail mean useful maale which is generally called as inbox I mean that is no folder name called H you might have seen inbox right so H is nothing but which is not the spam okay in this scenario mine learning algorithm is working to filter spam or not machine learning algorithm understand the previous mail data based upon the previous mail create some models these models applies on upcoming males and predict whether it is a spam or not now another application banking loan application also like to Samsung a loan to give a credit card or not for that also banking in the banking system also nowadays they are running the machine learning algorithm the banking loan application this is very common application of everyone knows once we applied for loan by submitting required documents data like you know pay SLE past six month bank statement Etc your kyc like AAR card pan pan card details each and everything right then banking guys will run one application over the given data this is machine learning algorithm this algorithm passes through the data and predict whether the loan or credit card will be sanctioned for you or not you are a eligible person to get that particular you know that particular uh loan or not or credit card or not clear guys any doubt so far any doubt so far now in addition that few more application I have written here guys don't think that this is the only application where we use machine learning nowadays each and Everywhere You Close Your Eye you throw the stone wherever it will hit if some tech tech is related to that definitely behind the scene machine learning are using machine learning they're using lot of machine learning algorithms okay some are like know text processing recognization traffic prediction product recommendation self driving car email spam or malware filtering that we have seen sometimes before online fraud detection weather forecasting and prediction is that why machine learning is required is a good question as a human we cannot access huge amount of data manually to process we can train machine learning algorithm by providing huge amount of data now machine learning algorithm travel through this data in in order to learn from data it Cates the model and predict result automatically for new data only technically speaking with the help of historical data machine learning algorithm built a mathematical model that helps in making prediction without being explicitly program we no need to write any expit program like from the scratch I have to run the machine learning algorithm on top of my historical data so that it will build a mathematical model which I will used to predict on the future data itself that is the beauty of mchine learning algorithm and all guys okay today guys I'm trying to you know you know create lot of you know basically I build the why we are here why we want to learn why there is a huge hype in the market like okay all are talking about machine learning machine learning mine learning what is this machine learning all together you might have okay learning we know self study or I am learning I'm studying something mine learning means mine is studying something but how machine learning will machine will study it it is not a human being right open the book and study by or no so as a human being as a programmer as a machine learning engineer you have to train your machine you have to train your computer so that your computer becomes more efficient and they can act they can uh they can behave like a human being clear guys any doubt so far please please let me know any doubt so now clustering yeah with this will complete and go back to my whiteboard and push clustering model again I told you clustering is nothing but group similar data point together without predefined label such grouping users with similar viewings on the streaming set to recommended similar context like clustering nothing but Market customer segmentation you can see let's say the combination of boys and girls I'll tell you could you please make two cluster so first cluster will contains all the GS and cluster will cont all the b or maybe men and Omen okay or maybe I will tell you let's say just cluster is based upon the age range so in between the age 10 to 20 make one cluster 21 to 30 make another cluster then 31 to 40 make another cluster and so on so that may be possible that is called clustering which is comes under on supervised machine learning all together now what is machine learning as we have already discuss machine learning models already discussed so it's Al also written two main category as WR here supervis and unsupervised this is a main category but for knowledge s also I have told you if you you look for any books or any you know internet or maybe any website it's generally three types in addition to supervis and unsupervised there is something called reinforcement learning all together now what is the difference between supervised and unsupervised machine learning guys it's written supervised learning model use label data to train and make prediction such as regression and classification but on supervised learning model on the other hand do not use label data instead focus on discovering pattern and relationship in the data such as clustering algorithm okay what is the label data on you know not labeling data not use the label data that will discuss in dep now for time let's come back to our whiteboard and we'll see guys any doubt so far please let me know okay if I go okay let me write down here so what is what is this supervised machine learning and on Super ma what is the difference actually okay uh reg will come back there's something called there let me write a scroll off supervised ML and another one is called [Music] on supervised Emil okay guys what is supervisor I mean the difference what is the difference gener in supervised machine learning we use the labeled data label data but in case of unsupervised ma algorithm uh we are not using not used labeled data okay not used label data what is label data now any that I'll show you while sharing my PP a beautiful diagrams are there just I'm just explaining for example guys think about label data okay so while giving the training data set or input data set I will tell you uh for example this is my kind of apple okay this is my Apple okay so round symbol so let's say this is my kind of orange okay and what else I can say let's say okay let's see great okay another food so let's say this is a labeling I'm giving okay kind of let's say this apple and this is orange orang orange and this is uh what another food let's say other food other food any food name XYZ okay XY fine so I know before in hand this is apple apple looks like this I know before in hand this looks like orange and I know this looks like XY Z foot so whenever tomorrow I will give you unknown data set for example I will give a data set like this uh and this is my mine learning model right so this is my uh mine learning model okay so it's training actually so after training I'm getting the outut Fantastic so what I'm doing I'm giving unknown data set for example on top of this training model I'll give a data set like this now it will predict and tell oh this happen how because while training it has observe okay Apple let's say apple color looks like this apple shape and size look like this okay Apple you know height width looks like this so based upon that you figure it out oh it looks like similar to Apple not like orange because it's a kind of round shape but not exactly round shape this is some kind of different St but this is not that kind of St so okay so I can figure it out this Apple getting me point so here I'm letting my model know this is my Apple orange this is my XYZ you know vegetable or sorry fruits that's why it's able to figure it out that is only possible in case of you know supervised machine learning which is nothing but we used the regression problem statement or classification problem statement so for regression problem statement and classification problem statement whatever the data set we are giving that is labeled data set only but while coming to unsupervised machine learning which is nothing but clustering clustering we are giving we are giving we are not giving label data set unlabeled data set basically unlabeled unlabeled unlabeled data set we are providing for uh clustering for training for training of a clustering algorithm clear guys any doubt so far any doubt so far any I'll show the beautiful diagram you'll be get much clar clear now let's come back to uh you know my what are things we are discussing sometimes before I have just in a beautiful manner pictural manner I have keeping in front of you see supervisor unsupervised learning method supervised machine learning which is nothing but we know kind of recreation and classification there we use the labeled data set that's why in the green color making pick Mark but coming to unsupervised machine learning which we know is nothing but a clustering algorithm we use there we are not using label data set that's why it's you know marking as a red color cross mark clear now what is the other difference I can say Yeah in case of let's say uh okay difference between the regression and classification I can say types of label data again if is label data let's say what kind of level data in case of supervised machine learning now coming to rec problem statement score of a particular student is Predictive Analytics scores it's nothing but continuous but spam or har for past email data is kind of cical it's not a continuous why because you are telling whether it's a good or bad true or false whether it will rain or not I mean yes or no true or false zero or one so kind of categorical data but coming to predictive analytic for example you want to predict what should be the price of a house of a 2bhk in so and so location but don't think that guys 2 bhk house price is same all over the India no it depends upon different different Factor whether it's just roadside or so too far from the roadside whether it's near to your office location or School location or just you know too far from your office and School location and again if it is a 2 bsk tell me the square foot area maybe uh some TOS cab squet area 12200 some TOS cab squet area 1500 and so on if it is too bigger size 1500 the price will be more so the price or the rent price or or maybe purchasing price whatever you are telling it depends on not only one factor depends upon multiple Factor like the location square foot area who is Builder who is town city like Tire one city or Tire two City or Tire three City and all that's why and whatever the price you will get is kind of continuous for example okay so they're telling for 12 sare ft for 2.5 bhk uh let's say uh the cost is around 55 lakhs or or 55 lakhs 60,000 something something like that so it's a kind of Predictive Analytics you are doing which is a continuous value it's not a categorical value you are not doing any classification getting my point guys okay F let's move to the next yeah now you can happily enjoy what I was talking 2 minute before that is label data and UNL data now think about the supervised learning the input data guys are you to see this is a label data okay I have keeping I have taken a different different kind of category or classes of animal you can see there's something called camel I have just lbel it you can see how I'm leveling so I'm keeping one animal okay this is nothing but elephant this is nothing camel this is of cow like similarly how I have given the example of fruits I know this is Apple I know this is orange I know this is banana I know this is papaya or something like that okay then I'm giving as a training data set now supervisor is nothing but is kind of trainer because the algorithm is training on top of the label data set the Dig output what will process so let's say I am giving a kind of let's apple fruit like kind of let's say elant this picture I'm a picture like this anal I'm giving or maybe this camel or this one I'm giving so now my model is predicting oh this picture is nothing but belongs to a category called elephant this picture is nothing but the name is called camel this picture is nothing but the name is called cow then how it is trying to identify the name of that Animal by seeing the picture why because I have given the label data set to train my model that's why while pred even though I'm giving unknown data set but based upon the similarity the characteristics the height because you can see elant let say Okay heavy in weight long tail dig trunk trk is absent for this one and this one so can oh in this animal animal who has strong only so if you give any animal strong or not strong blind you can tell this because in the world apart from Elan no other animal have been TK yes or no let's say teth is kind of let's G elephant kind of teeth is coming out so okay long teeth the elephant oh Cam very tall even taller than elephant also and that a keep kind of kind of I can say sa on top of the chamel right and here you can say cow cow looks like some some patches of the color let's this is black color this is kind of some sand color but this is kind of patch color white black patches and all so this kind of a c getting my point now this is called label data now coming to on super machine learning same things I can do same things but here guys see I am not labeling it I not telling my algorithm this is a chamel this is a elephant this is C I'm not telling I'm just giving randomly so my algorithm does not know whether we this is a elephant this is camel or a dog this is a cow or something else we don't know that's why interpretation unknown output no training data set now algorithm running now processing while processing as part of the output is trying to figure it out based upon the different characteristics what you mean that okay this symbol looks like different from this and this symbol looks like different from this so I'm trying to classify into two three different cluster like this is belongs to one category this is belong to another category this is belong to another category why because neither the shape and size nor the color nor the characteristics High where nothing is matching among them that's why I'm treated them as three different classes or cluster I hope now you are clear see one more time I'm just going back try to observe carefully here what is happening guys I'm giving the label data I'm telling my model hey man this is my camel this is elephant this is a cow so my model observe and try to understand oh aant looks like this okay a cam looks like this okay a cow looks like this okay so while giving the unknown data set you can see it is clear man this is why because while giving the training data set you have told me this is a kind of CH okay then what is that this is elephant why because while training you have given the label data set called as elephant and this is called as cow why because while giving the input data set you are given me telling me this is a cow that's why I also not only giving only pi I'm giving particular name oh this elephant this is camel this is a but guys in the on supervis miss learning I am not telling anything to my model that's why my model is unable to give the name whether we call we should have to call elephant or tiger or giraffe or lion whether we have to call this octopus or dinosaur or or whatever it may be or we have to call cow or dog or snake or whatever it may be we don't know that's why just giving three different classes why because neither the height color characteristics nothing is matching because looks and feel of this picture is different from this looks and feel of this picture is different from this so it consider three different classes all together guys any doubt so far please please let me know any doubt so yeah so clearly I have written here supervis versus unsupervised versus reinforcement forget for time now focus on this supervis data with labeled label data we are giving input data set here for all supervis data without Lael without Lael data set without data we are giv here supervised learning here unsupervised learning gener in case of superv learning what is happening so whatever Target is trying to predict so error will come then again retraining all the things will come finally is kind of mapping mapping in the sense I know this apple if I'm giving a picture or like you know fruits belongs to Apple then it will map belongs to Apple or this belongs to Orange this belongs to Banana this belongs to papaya so this kind of mapping is happening but in case of unsupervised machine learning where I'm giving unlevel data is kind of class it's creating different classes whose class does not know because I am not giv the label data I am not told what name you have to give so just giving different classes without naming there is no name that's why you can see here even the picture is Swing no name is displaying here like okay this elant or cam or because I not giv label letter the same things I'm giving for super machine learning is telling me Oh this belongs to Elephant belongs to chamel this belongs to cow why because the name is MTH with the picture here no math only classes three different classes created that's any doubt guys any doubt so far interesting guys don't worry we solve lot of problem and you will get you know 100% Clarity not okay let me see what is that yeah this thing also I have already dra types of machine learning like supervis and unsupervised coming to supervis we have something called regression then classification coming to all supervis we have something called clustering and diam reduction technique so what is written that's nothing but PCA principal comp analysis A too far higher Advanced machine learning so I don't think so it will be in your part of curriculum nothing to be wor okay we'll definitely cover clustering okay so that is after your you know mid semester exam and then before that we'll definitely cover regression and classification so we have seen today example Al some example Rel to classification that is you know classification of the email what it is a genuine email kind of inbox it should come to inbox or it should go to spam uh folder and coming to regression we are predicting uh it's going to rain or not what should be the house P Price uh belongs to a particular area or is based upon too far from office or School location and all okay clear guys any doubt so far any doubt so far okay now the actual Cinema will start let's let me go back to my white board guys any doubt so far please please let"
    },
    {
        "video_id": "X1PPZLfjrIM",
        "title": "🚀 Machine Learning Introduction | AI &amp; ML for Beginners",
        "url": "https://www.youtube.com/watch?v=X1PPZLfjrIM",
        "duration": 394,
        "transcript": "hey everyone welcome to statistic Insight today we are diving into Mission learning one of the most exciting technology shaping our old have you ever wondered how Netflix recommends your favorite shows or how Google translate language in seconds or how self-driving C recognize objects on the roads well that's all powered by Mission learning let's break it down in simple terms first what is Mission learning Mission learning is a branch of artificial intelligence that enables computers to learn from data without being explicitly programmed instead of giving the computer FX set of roles we feed it data and it learns pattern to make decisions example email spam detection Mission learning learns which emails are spam based on patterns like suspicious ODS or unknown centers the next example Voice assistance Siri or Alexa understand speech and respond based on Mission learning models trained on thousands of voice samples coming next types of mission learning there are three main types of mission learning one is supervised learning another one is unsupervised learning and finally reinforcement learning coming to supervised learning the model learn from label data that is input output pairs example predicting house prices based on size location and past sales next one unsupervised learning the model finds patterns in unlabeled data without specific answers example customer segmentation in marketing grouping similar customers based on shopping Behavior and the final one reinforcement learning the model learn learn through Trail and error by receiving rewards for correct actions example self driving cost learning to navigate Road safely and how machine Learning Works the machine learning process involves four key steps first one collecting data and training the model testing and evaluation finally making predictions coming to collecting data machine learning model need large amount of data the need the data might be images text or numbers and the next process training the model the model learns patterns using algorithms like neural network or tation toes and the next process testing and evaluation checking how well the model p performs on new data and the final making predictions the model applies that it learned to real world scenarios example training and image recognition model to identify cats and dogs and next popular machine learning algorithms there are many machine learning algorithms but here are some common ones they are linear regression dries neural networks and K means clustering coming to linear regression used for predicting values example predicting stock prices the formula for linear regression is y = mx + b where y predicted output that is dependent variable X input feature that is independent variable M slope coefficient of the line B intercept where the line crosses the X x-axis for multiple linear regression where there are multiple input variables for that y = to B plus B1 X1 plus B2 X2 so on up to B and xn where y predicted output X1 X2 so on x2 and input features B not intercept B1 B2 up to BN coefficient of each feature next one diation trees like a flowchart for making DS a diation tree that makes diation by splitting data into smaller groups based on conditions it works like a flow chart where each station leads to New Branch until it reaches a final outcome that is Lea note example e IT training yes stay inside no go outside the next one is it Sunny s go outside no stay inside the next one neural networks A system that mimix the human brain to recognize patterns the real time example is facial recognition in smartphones unlocks based on learned facial features and the final one k means clustering group similar data points into K clusters based on patterns the real time example is customer segmentation in e-commerce to recommend product based on shopping behavior and finally applications of machine learning machine learning is everywhere some real world application includes self-driving cars learning to recognize objects and make driving DS facial recognition unlocking phones with face ID fraud detection Banks use Mission learning to detect suspicious transactions and the finally healthare predicting disase based on medical data and that's Mission learning in a nutshell it helps Mission learn from data and make smart decs it is used in Industries like healthare finance and entertainment got a questions drop them in your comments do like share subscribe for more Tech insights hit the Bell icon for future updates thank you for watching see you in next video"
    },
    {
        "video_id": "_0-9d1xvyjM",
        "title": "Machine Learning || One Minute Concepts || Future Stack",
        "url": "https://www.youtube.com/watch?v=_0-9d1xvyjM",
        "duration": 293,
        "transcript": "welcome to an exploration of machine learning let's discover how computers can learn from data machine learning is a revolutionary approach that allows computers to learn without explicit programming to understand machine learning let's compare it with traditional programming in traditional programming we provide rules and data to get answers but in machine learning we provide data and answers and the computer learns the rules one of the most common applications is pattern recognition let's see how a machine learning model can learn to distinguish between different shapes the computer learns by analyzing many examples finding patterns in the data as the model processes more data its accuracy improves over time the learning curve shows how the model's accuracy increases as it sees more training examples eventually reaching a high level of performance in supervised learning the computer learns from labeled examples each training example is labeled with its correct category like these colored blocks labeled red and blue when given a new block the model can predict its category based on what it learned from the training data unsupervised Learning Works differently the computer finds patterns in unlabeled data the algorithm discovers natural groupings in the data like these two distinct clusters reinforcement learning involves an agent learning through trial and error the agent starts at one point and must find its way to the goal learning from its successes and failures through many attempts the agent learns to find more efficient paths to reach its goal let's explore how a neural network processes information through its layers when data enters the network it flows through connections between neurons with each connection having a specific weight or strength the network learns by adjusting the strength of connections based on the error in its predictions as the network trains the error decreases from 0.5 through weight adjustments as the network trains the error decreases from 0.3 through weight adjustments as the network trains the error decreases from 0.1 through weight adjustments after training the network can make accurate predictions by processing new data through its optimized connections this process of forward propagation and weight adjustment continues until the network achieves satisfactory performance to train a machine learning model effectively we split our data into three parts the training data which makes up about 60% of our data set is used to teach the model validation data about 20% helps us check if the model is learning properly or just memorizing the remaining 20% is our testing data which we we use only at the end to evaluate the model's final performance during training the model processes the training data multiple times adjusting its internal parameters to improve accuracy as training progresses we track both training and validation accuracy when validation accuracy stops improving or starts decreasing we know it's time to stop training to prevent overfitting once training is complete we can use our model to make predictions on new handwritten numbers the model assigns a confidence score to each prediction indicating how sure it is about its answer let's explore how machine learning helps filter spam emails from your inbox the system analyzes various features of each email and assigns confidence scores to determine if it's spam or legitimate movie recommendation systems analyze viewing patterns and ratings from similar users by finding users with similar tastes the system can suggest new content you might enjoy virtual assistants use multiple machine learning models to understand and respond to your queries your request goes through several processing steps speech recognition natural language processing context analysis and response generation finally the system generates an appropriate response based on the processed information self-driving cars use machine learning to understand their environment in real time the system continuously detects and classifies objects like other vehicles pedestrians and road signs based on these detections the car plans a safe path and makes driving decisions"
    },
    {
        "video_id": "dVvFeUTAuQU",
        "title": "Unlocking the Future: Introduction to AI/ML Concepts and Applications || IITRAM x GeeksforGeeks",
        "url": "https://www.youtube.com/watch?v=dVvFeUTAuQU",
        "duration": 2548,
        "transcript": "[Music] [Music] hi guys laston again [Laughter] hello yes e good afternoon guys we wait for 2 minutes and then we'll start start with the session meanwhile uh I have joined hi yeah hi that much meanwhile you have joined uh um you can just message me uh you can just type in the chat from which college you are okay uh is it audible now clearly please uh confirm in the chat uh is my voice audible clearly no yeah I suppose uh you're all uh college graduates who completed btech or from other streams right yeah okay uh so the main uh my voice is not audible one second okay okay thank you for uh first year okay that's good starting the preparation very early so uh you are here to like to get to know about more about the data science uh and the subjects in there and also I'll try to explain it more in a more um simple way rather and uh throwing many slides at you um we'll just start with U the PDF my name is Rahul and uh I'm a teaching assistant um in Gig for giges I've been doing it from uh two months so um we were going to discuss about um data science and what you are going to learn in this particular course and what are the main things that are currently going in um today U like it sector uh regarding data science and uh yeah how is the Jo are you guys excited let's make it more interactive you can you can just uh type type it in the chat yeah and before starting yeah before starting may I uh just want to know like what are the what are your interest regarding data science U why you are U why you got the dream to like choose this particular um technology anyone I'm just curious hello I I'll talk loudly okay um ml that's good ml yeah machine learning any other deep learning okay and most useful in the future of human okay for humans in case of yeah okay okay um so how many of uh you guys are uh mostly interested uh towards data science or data analytics I just want uh to know do you know the difference between them anyone we'll start with uh introduction to um I'm asking about uh do you know what uh what do you mean by data science or uh like difference between data science and uh this data analytics I just want to type the answers so yeah keep it in the chat no okay okay so uh we'll start with uh we start with the presentation and after that I'll let you know what are the things that you have to focus on so um yeah basics of m i I'll discuss yeah we'll start with um data science first so data science is a like it's a field where you use um statistics uh statistical methods and machine learning uh statistical methods and also mathematical Concepts to improvise the algorithms or uh to improvise understanding of the raw data that you have and um to get insights as well so we U you can see this diagram right this one yeah see um you can see uh like machine uh we'll start we talk about the artificial intelligence first and uh then um we'll discuss others so artificial intelligence is just um um a machine that uh also that mimics the human behavior which further builds upon the machine learning which is the subset of a and because uh we'll use machine learning by taking some yeah okay we'll take uh machine learning Concepts like uh linear regression and uh regression clustering and uh Concepts to understand the basic data that we have uh like in the tables and then we'll try to mimic that Behavior Uh and automate it through artificial intelligence and deep learning is a concept uh where we use neural networks like um you can say that um okay one second so uh to make it simple um in order to learn data science uh we first have to go through a programming language that is mostly uh related to uh that is mostly related to uh improvising the concepts that you have learned through statistic uh so you can uh always go with um python or R um python is very good language because you'll have extensive libraries uh to uh like naai pandas and uh mat to visualize and also work on numerical operations much more easily than other than other things so the first part uh that you have to do is uh learn a learn a language either python or that would be uh very much useful and uh thereafter um the second thing that you have to do is to understand uh the statistical Concepts uh Advanced statistical Concepts uh then after you can directly start with machine learning if you want to go through uh data science you can start with the machine learning uh basic concepts like uh regression uh clustering or classification and uh then after you can you can try building uh some basic uh basic projects so um we'll also talk talk about uh gen which is uh very much uh useful in nowadays like U the great example would be chat GPT um whenever uh we are trying to uh deug or code any uh new idea which we have in our mind uh we'll just type it out in a simple language and that will give us uh very uh data using uh like very uh user generative input from uh that promps that we have entered and uh see this is uh you can see uh the screen here this is a um scanning of our um human body to understand the disease diagnosis so uh in this case you can use deep learning because deep learning is a concept like where uh we can give a particular images images to the neural network and it will it will just uh break it down into several segments or uh you can say uh what we call uh it will break it down into several parts and it will try to understand based on the data that we have given previously and uh it will also run the model uh many times to understand what uh particular image that we have given and thereafter it can predict whether that particular uh output that we have right now in the screen uh whether we have pneumonia disase or no pneumonia it will give an output to us um yeah it will classify uh the outputs thereafter you can uh it will decide whether uh we have a particular adds or not and uh Gemini Gemini yeah Gemini from Google it's also a GPT model so I think the um Gemini is much more uh reliable and also it will give the information that is particularly uh related to the um particularly which are in the websites that we just Google it and uh see there are some websites also uh like co-pilot and uh you can just you can just uh type a general prompt like anything uh someone walking on the road orse someone typing the code it will just uh give an uh AI image that we want and we can use it anywhere we want that uh that has uh also given us much more uh what we say broader perspective of using Ai and our real life currently so coming to um statistical ml so you can see uh I can make you understand u in a much more simple way you can see that here we have a table of two columns and uh we have the area and prices list and uh numerical uh like we have numerical data so with this data you can uh build a linear regression model regarding uh by drawing a simple graph x xaxis and y axis you can just plot it uh plot it into this area into xaxis and the price into y axis and you can just view it in a much more simple way using bar graph or any other things uh other visualization techniques precisely to understand uh the given data in a much more easier way possible so um here neural networks yeah after statistics uh if I talk about the neural networks as I said before it will just classify uh it will just take your input image you if you uh you say let's take an example you have 100 images of uh different CS it will take those 100 images as input and thereby break down each pixel of that particular cat uh you can say uh if you have one cat photo it will just break it down into 100 pixels for example those 100 pixels and for one picture it's 100 pixels and then after another 100 pictures are there of the cat there thereby it will bre break down into another 100 100 um pieces those all will be given as input to the neural network then uh we'll add some convolutional layer or uh any other uh like hidden layers in between hidden layers are nothing but just uh where the computation happens where uh the features of the cat like the eye the ears and or the mouth or the skin that will be uh identified and stor in the hidden layers so after uh mixing all these uh inputs at the end of the last layer which is output layer it will just classify uh whether the given image which we give after uh creating the model we'll give an image either cat or dog as we have trained the model uh to identify the cat if you give a cat image then it will identify and give the output as a cat but if you give a dog image then it will uh it may not identify as a dog but it will not give the output as a cat that's the difference there so neural networks are basically uh very uh complex to understand but if you take a simple example or a simple data set or simple uh like 10 images or 20 images then it would be much more uh like it will will be easier to understand and to also train the model you cannot start with a a big data set uh containing 10,000 images but as to understand you have to start uh with Basics see um and uh one more thing uh talking about um machine learning as many guys of you like many of you guys are asking so machine learning is just a type of artificial intelligence U which allows machines to um learn from the data that we have that let's say we have an input data and also make decisions without being uh programmed or intervened uh we don't have to uh always uh try to um check that uh whether we have got an output or not it will just take the data and uh also redirects the input uh to the starting of the layer and it will again uh change the inputs to get the desired output so uh in machine learning there are many Concepts involved like um mainly data and then algorithms and then uh predictions uh what we want to get get as an output and then there's an evaluation if you have any error in the that particular model you have to uh um understand that error uh before uh getting the output as well or before uh what we say completing the project uh and then after uh taking an algorithm and implementing it you'll uh you have to optimize that particular uh what we say uh um optimize a particular algorithm and also it just weights to improve it so uh these are all um let's forget about these Concepts uh this uh what we say um Concepts inside the ml we'll just talk about the basic stuff here so um as I said before uh we have to Learn Python and then uh statistic Concepts which is uh you can see here the statistical ML and then uh you have to do a project uh we'll do a project on ML machine learning using basic uh features or basic data set uh you can find it on uh any uh website as well like KAG and uh after that you can uh you can just deploy your model uh into some websites or you can directly added to the resume that would be much more uh like what we say helpful for your career as well see um I think everyone knows uh Google um like Google Translation how many of you know about Google Translation or how many of you used in real life so Google Translation works on um a concept in ml which is natural uh language processing uh which is NLP see uh I'll explain it in more simple way so if you have a sentence like I love eating pza so this uh NLP NLP is uh natural language processing which understands the meaning of the meaning of the words that we you have given for example uh as a noun verb or uh you can say you can you know parts of speech right so it will identify the parts of speech of the sentence and also understand uh whether that particular um word uh that particular sentence that you have chosen has ause positive meaning or negative meaning then uh it will justify or it will give you an output based on that so uh Google Translate is used in that way see uh you can see like uh there you have typed I love us and you get an output in the second second box yeah you can also listen to it uh this example and you can see the example here this is also based on natural language processing so uh okay boring okay uh just leave it aside leave the slides aside uh I'll explain it more simply what do you mean by data sent so um if you want to uh like just uh understand or uh want to pursue a career in data science just start with uh learning the things practically first um just start with uh python uh don't try to learn uh everything completely just try to uh learn learn as small as possible and try to implement it in a practical way suppose if You Learn Python just do a project on python so the road map that I um that I want to explain to you guys is if you if anyone of you guys are in first year or second year or um graduated uh and are interested in uh doing data science just start with uh Python programming language okay and uh thereafter you can start with Statistics basic statistics uh like mean Moree median or measure of central like those Concepts measure of central tendency and uh thereafter uh you can start with uh ml directly if you want to go to uh go towards the data sign start with ML and uh just learn about the basic algorithms linear regression logistic regression classification clustering K clustering so learn about these things and try to implement uh try to use jupter notebook and implement it uh Implement these Concepts through uh the knowledge that you have learned in a more practical way that would be very much helpful for you guys and uh thereafter uh you can uh dwell into deep learning if you're interested in identifying um images or uh if you are interested in working with uh image classification particularly so um deing is much more complex to be honest but if you are uh if you are um as long as you are implementing it uh by um what we say learning uh by taking a project or by taking a data set then you'll Master it but don't try to learn uh don't try to keep on learning the stuff try to implement it as as far as possible um that's my uh suggestion if you want to thrive in the data science field and uh thereafter uh if you want to uh work on um particular uh things like as I shown as a Google translate or things then you can uh try to use natural language processing you have many Concepts uh embedded into artificial intelligence and data science but uh it would be helpful to get a good knowledge good basic knowledge uh and practical knowledge as well on the concepts that we have see um can you uh can you guys see my screen guys uh can anyone confirm okay screen is not visible I share it again is it visible now anyone no I think the screen is visible okay okay got it see uh you can see here in the Python programming language you learn uh about the basics of python and then uh data structures like um list triup and uh sets and dictionaries and there after as I said we'll use several libraries like map. Li and cbone to uh yeah okay uh to visualize and also uh plot graphs and they uh and then you'll use pandas and nay for Eda particularly to uh load the data set and also work on numerical features and thereafter you'll learn about machine learning algorithms as I said basic statistics and statistics in ml and uh regression regression problems means regression is a like u a basic uh what you say algorithm in machine learning and uh there after you learn classification algorithms um and clustering as well uh I'll explain about uh clustering if uh in a more simple way to make you understand so uh if you have any three features or three color boards if you say blue red and and green so uh for example if you have dropped all those 100 walls of three different kinds in a particular uh um particular floor then uh clustering is a very good example that uh it will just uh um divides or uh it will just make uh those particular three groups into uh individual uh what we say I'll just show I'll just show you a picture that would be more interactive to make you understand yeah uh can you see this see see here screen is not visible [Music] uh yeah sorry guys for the inconvenience is my screen visible now okay leave that no issue I'll just move on with the topic um so you learn about machine learning algorithms some basic machine learning algorithms related to regression classification and clustering and uh thereafter you'll learn more about uh natural language processing which is another subject like machine learning and deep Lear learning which helps to uh identify and understand uh which basically uh um gives us uh the chance to work with uh not profit okay which basically gives us the chance to work with the text data and there are also sever conception NLP which is one h coding bag of words and TD factorer so these are the concepts that you will learn in NLP and as I said in deep learning you'll have artificial neural networks and uh forward propagation backward propagation this forward propagation and backward propagation are uh just to uh make your model much more effective and uh activation functions is uh activation functions or lost functions are uh particularly which I mentioned before about uh that when I'm explaining about the images of the cat where we have a hidden layer in between so in that hidden layer these activation functions are particularly used to um understand about uh or to solve about the complexity of uh complex um to solve the complex problems that uh we have uh in that particular model and uh we'll just skip this part okay and okay um so related to gen uh you'll uh just uh you learn more about um chat gbt and also how to use the prompts that you have um to get uh more from the platform okay so use uh we'll also learn more about uh generative like Char and [Music] gini to understand or to uh get much more uh effective Solutions or uh from our uh like for our particular inputs and you can use you can get the most out of it if you have any uh questions or doubts or if you have any ideas that will uh by entering uh some easy prompts you'll uh get a much more broader view of what you are uh currently um trying to do so yeah so after completing this ml projects um mlr deep learning projects you'll further uh you'll further into uh at the last step you have to deploy compulsory so for that you'll learn about AWS uh Amon web services and aure I think these uh the AWS andure are the must to deploy the machine learning models that we have created Rel related to data science and uh yeah yeah that's it uh that's it for the subject that uh we are trying uh we try to cover today so if you guys have any doubts uh regarding uh any of the any of the things that I have shared you can just uh ask me in the chat or else uh I can just uh I can just give you a summary of what uh I have told until now uh any of you are having any [Music] questions e I guess no one is having any questions to ask okay uh okay and uh so in gigs for gigs U we are currently U like focusing on um uh course particularly related to data science and data analytics uh so you have uh 3 months of uh if you take a course uh for example related to data science uh you have 3 months to complete it that is 90 days if you can complete that uh those modules or the questions or the assignments that they have given uh in the module um the Geeks for geeks website uh after you purchase this course if you can complete all the uh modules and all the assignments that uh they have given in the uh given time which is 90 days before uh 90 days you'll uh get a 90% refund refund of that uh entire course fees that you have paid only if you uh completed before 90 days so that's a good challenge actually uh for anyone who is interested and who is trying to uh um take a challenge or uh who who are trying to learn about her data science I think uh we have amazing uh what we say an amazing uh modules to uh get to know about uh data science Concepts and even U some good questions to understand about the algorithms of machine learning and deep learning so on every course uh not only one course or not only on data science or data analytics on every course that we are uh currently having uh you'll get a 90% refund if you complete the course only in uh on before 90 days you can use the copon here which I have mentioned and yeah that's it guys uh if you guys have have any doubts I'll be here for another five minutes uh you can ask and uh give you a proper guidance regarding that and uh thank you guys for everyone for joining the session and for being patient enough"
    },
    {
        "video_id": "2UZXau2BLmk",
        "title": "AI vs ML Engineer #shorts #ml #ai",
        "url": "https://www.youtube.com/watch?v=2UZXau2BLmk",
        "duration": 40,
        "transcript": "confused between AI engineer and ml engineer interview here's a video to help you out both types of interviews include questions about software engineering fundamentals General programming skills and collaboration abilities the major difference between the both is that AI engineering interviews may ask about natural language processing computer vision or speech recognition while ml engineering interviews may include questions about traditional and newer machine learning techniques for additional interview prep resources check out prepfully.com using the link in the description and if you found this video helpful don't forget to like And subscribe"
    },
    {
        "video_id": "Kj6cMqs4nQU",
        "title": "AI, ML DL TOO",
        "url": "https://www.youtube.com/watch?v=Kj6cMqs4nQU",
        "duration": 141,
        "transcript": "[Music] day one learning AI machines that talk and fly what wonders they can do oh it's true yes it's true machines with mind so bright learning through Day and Night Magic in their code lines Oh They'll shine they shine a i m l d L2 uncovering the new worlds that we could never view techy dreams coming through what is AI do you ask it's computers wearing masks solving puzzles with their mind taking us to new heights a i m l d l to uncovering the new worlds that we could never view techy dreams coming through [Music] what is a I do you ask it's computers wearing masks solving puzzles with their might taking us to new heights applications far why from house to open Skies eyes touching every side ride this glowing tight [Music]"
    }
]